# Remove Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportFontTable..::..Remove Method
ExportFontTable Class See Also
---
Removes the pair (key, info) by font key.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void Remove(
	ExportFontKey exportFontKey
)
```

Visual Basic
---
```text
Public Sub Remove ( _
	exportFontKey As ExportFontKey _
)
```

Visual C++
---
```text
public:
void Remove(
	ExportFontKey^ exportFontKey
)
```

# ### Parameters
exportFontKey
    Type: Autodesk.Revit.DB..::..ExportFontKey The export font key.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExportFontTable Class
Autodesk.Revit.DB Namespace